export const earningData = {
  title: "إجمالي الأرباح",
  message:
    "كل الأموال التي دخلت عن طريق العملاء ( أفرادا و جماعات) عن طريق التطبيق و موقع لوجيست لتوصيل. لشهر الحالي",
  totalEarning: 750050,
  total: 3471199,
  target: "ريال",
  earnings: [
    500, 352, 548.25, 545, 325.35, 264.85, 362, 582.25, 695, 214.35, 395.25,
    394, 498.21, 185, 325.35, 500, 352, 548.25, 545, 325.35, 500, 352, 548.25,
    545, 325.35, 500, 352, 548.25, 545, 325.35,
  ],
};

export const driversData = {
  title: "إجمالي السائيقين",
  message:
    "كل السائقين الجدد المسجلين عن طريق منصات لوجيست الموبايلو الحواسيب الدكية للشهر الحالي.",
  totalEarning: 39000,
  total: 169162,
  target: "سائق",
  earnings: [65, 50, 35, 5, 80, 150],
};

export type dataType = {
  month: string;
  title: string;
  message: string;
  totalEarning: number;
  total: number;
  target: string;
  earnings: Array<number>;
};

export const earningData2: Array<dataType> = [
  {
    month: "يناير 2022",
    title: "إجمالي الأرباح",
    message:
      "كل الأموال التي دخلت عن طريق العملاء ( أفرادا و جماعات) عن طريق التطبيق و موقع لوجيست لتوصيل. لشهر الحالي",
    totalEarning: 111111,
    total: 11111111,
    target: "ريال",
    earnings: [
      500, 352, 548.25, 545, 325.35, 264.85, 362, 582.25, 695, 214.35, 395.25,
      394, 498.21, 185, 325.35, 500, 352, 548.25, 545, 325.35, 500, 352, 548.25,
      545, 325.35, 500, 352, 548.25, 545, 325.35,
    ],
  },
  {
    month: "فبراير 2022",
    title: "إجمالي الأرباح",
    message:
      "كل الأموال التي دخلت عن طريق العملاء ( أفرادا و جماعات) عن طريق التطبيق و موقع لوجيست لتوصيل. لشهر الحالي",
    totalEarning: 222222,
    total: 22222222,
    target: "ريال",
    earnings: [
      394, 498.21, 185, 325.35, 500, 352, 548.25, 545, 325.35, 500, 352, 548.25,
      545, 325.35, 500, 352, 548.25, 545, 325.35,
    ],
  },
];

export const totalEarningData = {
  title: "إجمالي الأرباح",
  message:
    "كل الأموال التي دخلت عن طريق العملاء ( أفرادا و جماعات) عن طريق التطبيق و موقع لوجيست لتوصيل.  ",
  totalEarning: 750050,
  total: 100000000,
  target: "ريال",
  earnings: [
    550, 352, 548.25, 545, 325.35, 264.85, 362, 582.25, 695, 214.35, 395.25,
    394, 498.21, 185, 325.35, 500, 352, 548.25, 545, 325.35, 500, 352, 548.25,
    545, 325.35, 500, 352, 548.25, 545, 325.35,
  ],
};
