import { Files } from "./../containers/Chat/styles";
const img1 =
  "https://ps.w.org/user-avatar-reloaded/assets/icon-128x128.png?rev=2540745";

export type DriverDto = {
  id: number;
  userPhoto: string;
  userName: string;
  message: string;
  time: string;
  images: [];
  selectedImages: [];
  files: File[];
};

export const messagesData = [
  {
    user: 1,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [
      "/images/chatImg.png",
      "/images/chatImg2.png",
      "/images/chatImg3.png",
      "/images/chatImg2.png",
      "/images/chatImg.png",
      "/images/chatImg2.png",
      "/images/chatImg3.png",
      "/images/chatImg2.png",
      "/images/chatImg.png",
    ],
    files: [],
  },
  {
    user: 2,
    userPhoto: "/images/photo.png",
    userName: "عبد الله",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 1,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },

  {
    user: 2,
    userPhoto: "/images/photo.png",
    userName: "عبد الله",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 1,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 1,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 2,
    userPhoto: "/images/photo.png",
    userName: "عبد الله",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 2,
    userPhoto: "/images/profilePhoto.png",
    userName: "عبد الله",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },

  {
    user: 2,
    userPhoto: "/images/photo.png",
    userName: "عبد الله",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 1,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [
      "/images/chatImg.png",
      "/images/chatImg2.png",
      "/images/chatImg3.png",
      "/images/chatImg2.png",
      "/images/chatImg.png",
      "/images/chatImg2.png",
      "/images/chatImg3.png",
    ],
    files: [],
  },
  {
    user: 2,
    userPhoto: "/images/profilePhoto.png",
    userName: "عبد الله",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 3,
    userPhoto: "/images/profilew.png",
    userName: "سارة الجنيبى",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 1,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 3,
    userPhoto: "/images/profilew.png",
    userName: "سارة الجنيبى",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 4,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 4,
    userPhoto: "/images/profile3.png",
    userName: "على محمد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 4,
    userPhoto: "/images/profile3.png",
    userName: "على محمد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 5,
    userPhoto: "/images/profile2.png",
    userName: "أمير خان",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 1,
    userPhoto: "/images/profilePhoto.png",
    userName: "خالد",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
  {
    user: 5,
    userPhoto: "/images/profile2.png",
    userName: "أمير خان",
    message:
      "كمان أن وقام وبدأت . لم أدوات للمجهود بلا . إذا لها الأول الستار . تحت وصغار مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على مدينة على. أى بحشد ليرتفع الساحلية أما . ليركز على الهادى الاسطول ما هذا ! مدينة على. أى بحشد ليرتفع الساحلية أما .  أسابيع الروسية وتم عن . وفى مع شدت فكان أدوات . سمى تعداد.",
    time: "4:07PM",
    images: [],
    selectedImages: [],

    files: [],
  },
];
