/* export type matchType = {
  id: number;
  name: string;
  photo: string;
  hour: string;
  minute: string;
  ampm: string;
  day: number | undefined;
  month: number | undefined;
  year: number | undefined;
}; */

export const newsData = [
  {
    id: 1,
    date: "الأحد - 13 مارس",
    news: "تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..",
  },
  {
    id: 2,
    date: "الأحد - 13 مارس",
    news: "تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..",
  },
  {
    id: 3,
    date: "الأحد - 13 مارس",
    news: "تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..",
  },
  {
    id: 4,
    date: "الأحد - 13 مارس",
    news: "تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..تفاصيل الخبر تكتب هنا ..",
  },
];
